Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: སྡིག་དེ་བཅབ་པར་མི་བྱའོ། །
en: I will not conceal those bad actions, Those wrong actions that I have done.

source: ལུས་ཀྱི་ལས་ནི་རྣམ་གསུམ་དང་། །ངག་གི་རྣམ་པ་བཞི་དག་དང་། །ཡིད་ཀྱི་རྣམ་པ་གསུམ་པོ་རྣམས། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘There are three kinds of physical actions; There are four kinds of verbal actions; There are three kinds of mental actions— I make a confession of them all.

source: ལུས་ཀྱིས་བགྱིས་དང་ངག་གི་ལས། །ཡིད་ཀྱིས་རྣམ་པར་བསམས་པ་དང་། །ལས་རྣམས་བཅུ་པོ་བགྱིས་པ་དག །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘Those actions done physically, those done verbally, And those done mentally— The ten kinds of karma I have created— I make a confession of them all.

source: མི་དགེ་ལས་བཅུ་སྤངས་ནས་སུ། །དགེ་བ་བཅུ་པོ་བསྟེན་བགྱིས་ཏེ། །
en: “ ‘Having forsaken the ten bad actions, I will practice the ten that are good.

source: ས་བཅུ་ལ་བདག་གནས་པར་བགྱི། །སྟོབས་བཅུ་མཆོག་ཏུ་འགྱུར་བར་བགྱི། །
en: I will dwell upon the ten bhūmis And be endowed with the ten supreme strengths.

source: བདག་གིས་སྡིག་པའི་ལས་གང་དག །མི་འདོད་འབྲས་བུ་ཐོབ་བགྱིད་པ། །
en: “ ‘Whatever bad karma I possess Will bring undesirable results.

source: སངས་རྒྱས་སྤྱན་སྔར་མཆིས་ནས་ནི། །དེ་དག་ཐམས་ཅད་བཤགས་པར་བགྱི། །
en: I make a confession of all of it In the presence of the buddhas.

source: འཛམ་བུའི་གླིང་འདིར་གང་དག་དང་། །འཇིག་རྟེན་ཁམས་ནི་གཞན་དག་ཏུ། །གང་རྣམས་དགེ་བའི་ལས་བགྱིད་པ། །དེ་དག་ཀུན་ལ་ཡི་རང་ངོ་། །
en: “ ‘Whatever good actions have been done, Whether in this Jambudvīpa Or in other world realms, I rejoice in them all.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ཀྱང་། །བདག་གིས་བསོད་ནམས་གང་བསྒྲུབས་པ། །བདག་ནི་དགེ་བའི་རྩ་བ་དེས། །བྱང་ཆུབ་མཆོག་ལ་རེག་པར་བགྱི། །
en: “ ‘Whatever merit I have created Through my body, speech, and mind, Through those meritorious roots I will reach the highest enlightenment.

source: སྲིད་འགྲོ་ཉམ་ངར་བྱིས་པའི་བློ་ཡིས་ནི། །ཤིན་ཏུ་མི་བཟད་སྡིག་པ་གང་བགྱིས་པ། །སྟོབས་བཅུ་མི་མཉམ་སྤྱན་སྔར་མཆིས་ནས་ནི། །སྡིག་པ་དེ་ཀུན་སོ་སོར་བཤགས་པར་བགྱི། །སྐྱེ་བ་ཉམ་ང་སྲིད་པ་ཉམ་ང་དང་། །
en: “ ‘Whatever dreadful bad actions have been made By a foolish mind distressed within existences, I confess each one of those bad actions Before the unequaled one with the ten strengths.

source: འཇིག་རྟེན་ཉམ་ང་གཡོ་སེམས་ཉམ་ང་དང་། །ལུས་ཀྱི་སྤྱོད་པ་ཉམ་ང་སྣ་ཚོགས་ཀྱིས། །བདག་གིས་སྡིག་པ་གང་བསགས་དེ་འཆགས་སོ། །བྱིས་པ་བླུན་བྱས་ཉོན་མོངས་ཉམ་ང་དང་། །སྡིག་པའི་གྲོགས་དང་ཕྲད་པ་ཉམ་ང་དང་། །སྲིད་པ་ཉམ་ང་འདོད་ཆགས་ཉམ་ང་དང་། །
en: “ ‘I confess whatever bad karma I have accumulated In dangerous lives, in dangerous existences, In dangerous worlds, with a dangerous and unstable mind, Through various kinds of dangerous physical behavior.

source: ཞེ་སྡང་ཉམ་ང་གཏི་མུག་ཉམ་ང་དང་། །ངལ་བའི་ཉམ་ང་དུས་ཀྱི་ཉམ་ང་དང་། །བསོད་ནམས་བསྒྲུབས་པ་ཉམ་ང་དག་གིས་ཀྱང་། །རྒྱལ་བ་མི་མཉམ་མངོན་སུམ་མཆིས་ནས་ནི། །སྡིག་པ་དེ་ཀུན་སོ་སོར་བཤགས་པར་བགྱི། །
en: “ ‘In the presence of the unequaled jinas, I confess every single bad action I have done Because of perilous, foolish stupidity and kleśas, Because of perilous association with wicked friends, “ ‘Because of perilous saṃsāra and perilous desire, Because of perilous anger and perilous ignorance, Because of perilous fatigue and perilous times, And because of a perilous lack of producing merit.

source: སངས་རྒྱས་གསེར་མདོག་རི་སྣང་རི་རབ་འདྲ། །ཡོན་ཏན་རྒྱ་མཚོ་འདྲ་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘I praise the buddhas, who are like shining golden mountains, Who are like Sumeru, and like oceans of qualities.

source: རྒྱལ་བ་དེ་དག་རྣམས་ལ་སྐྱབས་སུ་མཆི། །རྒྱལ་བ་དེ་དག་ཀུན་ལ་མགོས་ཕྱག་འཚལ། །
en: I go for refuge to those jinas And bow my head to all those jinas.

source: གསེར་མདོག་གསེར་ནི་དྲི་མ་མེད་པ་གསེར་གྱི་འོད། །དྲི་མེད་རྣམ་དག་བཻ་ཌཱུརྱའི་ཡན་ལག་སྤྱན། །སངས་རྒྱས་ཉི་མ་དཔལ་གཟི་གྲགས་འབར་འབྱུང་བའི་གནས། །ཐུགས་རྗེའི་འོད་ཟེར་དག་གིས་མུན་པ་མུན་ནག་བསལ། །
en: “ ‘Golden in color, stainless gold, golden light, With the feature of eyes of pure, stainless beryl— A buddha sun, the source of glorious brilliance and blazing fame Dispelling deep darkness with the light rays of compassion.

source: ཡན་ལག་རབ་ཏུ་དྲི་མེད་རབ་བཟང་རྣམ་པར་མཛེས། །སངས་རྒྱས་ཉི་མ་ཡན་ལག་དྲི་མེད་གསེར་འདྲས་ཁྱབ། །
en: “ ‘With perfectly stainless, very beautiful, excellent limbs, The buddha sun’s limbs are as if covered with stainless gold.

source: ཉོན་མོངས་མེས་གདུངས་ཡིད་ཅན་འབར་བའི་མེ་འདྲ་བ། །ཐུབ་པའི་ཟླ་བའི་འོད་ཟེར་དྲ་བས་ཚིམ་པར་མཛད། །
en: The light rays of the muni moon bring pleasure To minds pained by the fires of the kleśas, which are like blazing fires.

source: མཚན་མཆོག་སུམ་ཅུ་གཉིས་ཀྱིས་དབང་པོ་ཡན་ལག་མཛེས། །དཔེ་བྱད་བཟང་པོ་དག་གིས་ཡན་ལག་རྣམ་པར་མཛེས། །དཔལ་གཟི་བསོད་ནམས་འབར་འཁྲུགས་འོད་ཟེར་དྲ་བ་ཡིས། །འཇིག་རྟེན་གསུམ་ན་མུན་ཁྲོད་ཉི་མ་བཞིན་དུ་བཞུགས། །
en: “ ‘With faculties and limbs beautified by the thirty-two supreme signs, Limbs beautified by the excellent features, And with a net of light rays producing blazing, glorious, brilliant merit, You are present like the sun in the darkness of the three worlds.

source: དྲི་མེད་རྒྱ་ཆེན་ཁ་དོག་སྣ་ཚོགས་བཻ་ཌཱུརྱ། །སྐྱ་རེངས་དམར་དང་དངུལ་དང་ཤེལ་བཞིན་ཡན་ལག་དམར། །འོད་ཟེར་དྲ་བ་རྣམ་པ་སྣ་ཚོགས་ལེགས་བརྒྱན་པས། །ཐུབ་ཆེན་ཁྱོད་ནི་ཉི་མ་བཞིན་དུ་དེ་བཞིན་མཛེས། །
en: “ ‘Body aspects the color of vast, beautiful, stainless beryl; The red of dawn, silver, crystal, and copper-red; Adorned by a net of light rays of various colors, You, great Muni, are beautiful like the sun. “ ‘The multitude of light rays from the sun of the sugatas dry up The intensely fierce and violent ocean of suffering.

source: མྱ་ངན་འཁྲུག་པ་འཆི་ཆུ་རྒལ་བའི་དབའ་རླབས་ཅན། །འཁོར་བའི་ཀླུང་ཆེན་ཕོངས་པའི་ཆུ་བོར་ལྷུང་བ་ལ། །སྡུག་བསྔལ་རྒྱ་མཚོ་མཆོག་ཏུ་རྩུབ་ཅིང་ཤུགས་དྲག་པ། །བདེ་གཤེགས་ཉི་མའི་འོད་ཟེར་མང་པོ་རྣམས་ཀྱིས་སྐེམས། །
en: Falling into the river of distress, the great river of saṃsāra, Waters of death and waves of aging churn with misery.

source: ཡན་ལག་གསེར་གྱི་མདོག་ཏུ་རྣམ་པར་སྣང་། །ཡེ་ཤེས་འབྱུང་གནས་འཇིག་རྟེན་གསུམ་ཀུན་མཆོག །
en: “ ‘I praise the buddhas, who have golden bodies, The source of wisdom, supreme within the three worlds.

source: རབ་མཛེས་མཚན་གྱིས་ཡན་ལག་རྣམས་སྤྲས་པ། །སངས་རྒྱས་གསེར་སྐུ་འབར་ལ་ཕྱག་འཚལ་ལོ། །
en: Their limbs shine with the color of gold; Their limbs are adorned by beautiful signs.

source: ཇི་ལྟར་རྒྱ་མཚོའི་ཆུ་ནི་དཔག་མེད་དང་། །ཇི་ལྟར་ས་ལ་ས་རྡུལ་མཐའ་ཡས་དང་། །ཇི་ལྟར་རི་རབ་རྡོ་མཐའ་མཚུངས་མེད་དང་། །ཇི་ལྟར་ནམ་མཁའི་མཐའ་མ་མཐའ་ཡས་པ། །དེ་བཞིན་སངས་རྒྱས་ཡོན་ཏན་མཐའ་ཡས་ཏེ། །
en: “ ‘Just as the water of the ocean is immeasurable, Just as the particles in the earth are infinite, Just as there is no end of stones in Meru, And just as there is an endless extent to space, “ ‘The qualities of a buddha are similarly infinite.

source: སེམས་ཅན་ཀུན་གྱིས་ཤེས་པར་མི་ནུས་སོ། །
en: There is no one among all beings who can know them.

source: བསྐལ་པ་དུ་མར་གཞལ་ཅིང་བསམས་ཀྱང་ནི། །ཡོན་ཏན་མཐའ་མ་ཤེས་པར་མི་ནུས་སོ། །
en: Even if they examined and contemplated for many eons, They still would not know the end of those qualities.

source: ཆུ་ནི་སྐྲ་ཡི་རྩེ་མོའི་ཚད་ཙམ་དང་། །རྡོར་བཅས་རིར་བཅས་རྒྱ་མཚོར་བཅས་པ་ནི། །བསྐལ་པ་བགྲངས་ན་ཤེས་པར་ནུས་ཀྱང་སྲིད། །
en: “ ‘By counting for eons one may know how many measures, Each the size of a drop of water on the tip of a hair, There are in the earth, with its stones, mountains, and oceans.

source: སངས་རྒྱས་ཡོན་ཏན་ཕ་མཐར་ཤེས་མི་ནུས། །
en: But one could never perceive a limit to the qualities of a buddha.

source: ཡོན་ཏན་ཁ་དོག་སྙན་དང་གྲགས་པ་དང་། །དགེ་བའི་མཚན་གྱིས་བརྒྱན་པའི་སྐུ་ལུས་དང་། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་བརྒྱན་པ་ཡིས། །སེམས་ཅན་ཐམས་ཅད་དེ་འདྲར་འགྱུར་བར་ཤོག །
en: “ ‘May all beings become like that, With those qualities, colors, fame, and renown, With bodies adorned by the signs of goodness And beautified by the eighty features.

source: བདག་གི་དགེ་བའི་ལས་རྣམས་འདི་དག་གིས། །འཇིག་རྟེན་མི་རིང་སངས་རྒྱས་འགྱུར་བར་བགྱི། །
en: “ ‘May I, through this good karma, Become before long a buddha in the world.

source: འགྲོ་ལ་ཕན་ཕྱིར་ཆོས་ཀྱང་བསྟན་པར་བགྱི། །སེམས་ཅན་སྡུག་བསྔལ་མང་གཟིར་ཐར་བར་བགྱི། །
en: May I teach the Dharma for the benefit of beings, And may I free beings afflicted by many sufferings.

source: སྟོབས་བཅས་སྡེར་བཅས་བདུད་ལས་རྒྱལ་བར་བགྱི། །
en: “ ‘May I be victorious over powerful Māra and his army.

source: ཆོས་ཀྱི་འཁོར་ལོ་དགེ་བ་བསྐོར་བར་བགྱི། །
en: May I turn the good wheel of the Dharma.

source: བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་གནས་པར་བགྱི། །བདུད་རྩིའི་ཆུ་ཡིས་སེམས་ཅན་ཚིམ་པར་བགྱི། །
en: May I remain for countless eons, And may I satisfy beings with the water of amṛta.

source: ཇི་ལྟར་སྔོན་གྱི་རྒྱལ་བས་རྫོགས་པ་ལྟར། །ཕ་རོལ་ཕྱིན་དྲུག་བླ་མེད་རྫོགས་པར་བགྱི། །
en: “ ‘May I bring to completion the supreme six perfections, Just as the jinas of the past have completed them.

source: ཉོན་མོངས་གཞོམ་ཞིང་སྡུག་བསྔལ་བསལ་བར་བགྱི། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཞི་བར་བགྱི། །
en: May I destroy the kleśas and clear away suffering, And bring desire, anger, and ignorance to an end.

source: སྐྱེ་བ་བརྒྱ་དང་སྐྱེ་བ་བྱེ་བ་སྟོང་། །བདག་ནི་རྟག་ཏུ་སྐྱེ་བ་དྲན་པར་བགྱི། །
en: “ ‘May I always remember lifetimes— A hundred lifetimes, ten billion lifetimes.

source: ཐུབ་པའི་དབང་པོ་རྟག་ཏུ་དྲན་པར་བགྱི། །དེ་ཡི་གསུང་ནི་རྒྱ་ཆེན་ཐོས་པར་བགྱི། །
en: May I constantly recollect the lords of munis, And may I listen to their vast speech.

source: བདག་ནི་དགེ་བའི་ལས་རྣམས་འདི་དག་གིས། །རྟག་ཏུ་སངས་རྒྱས་འགྲོགས་པ་རྙེད་པར་བགྱི། །
en: “ ‘May I through these good actions Always succeed in meeting with buddhas.

source: སྡིག་པའི་ལས་རྣམས་རྣམ་པར་སྤང་བར་བགྱི། །དགེ་བའི་འབྱུང་གནས་དགེ་རྣམས་སྤྱད་པར་བགྱི། །
en: May I completely forsake bad actions And may I practice good actions, the source of merit.

source: ཞིང་རྣམས་ཀུན་ན་སྲོག་ཆགས་ཐམས་ཅད་ཀྱང་། །འཇིག་རྟེན་དག་ན་སྡུག་བསྔལ་ཀུན་ཞི་གྱུར། །
en: “ ‘May all the bad karma of all beings In every realm come to an end in their worlds.

source: སེམས་ཅན་དབང་པོ་མ་ཚང་ཡན་ལག་ཉམས། །དེ་ཀུན་དེའུ་རེ་དབང་པོ་ཚང་བར་ཤོག །
en: May those beings with impaired faculties and defective limbs All possess complete faculties on this day.

source: གང་དག་ནད་བཏབ་ཉམ་ཆུང་ལུས་ཉམས་དང་། །ཕྱོགས་བཅུ་དག་ན་སྐྱབས་མེད་གྱུར་པ་རྣམས། །དེ་ཀུན་མྱུར་དུ་ནད་ལས་ཐར་གྱུར་ཅིག །ནད་མེད་སྟོབས་དང་དབང་པོ་རྙེད་པར་ཤོག །
en: “ ‘May those in the ten directions who have no protector, And are sick, weak, and feeble in body, All be quickly freed from illness And gain health, strength, and their faculties.

source: གང་དག་རྒྱལ་པོ་ཆོམ་རྐུན་བྲེད་བསྡིགས་བསད་ཐུག་དང་། །སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་ཡིས་ཕོངས་གྱུར་པ། །སེམས་ཅན་ཉམ་ཐག་གྱུར་ཅིང་སྡུག་བསྔལ་དེ་དག་ཀུན། །འཇིགས་མཆོག་མི་བཟད་བརྒྱ་པོ་དེ་ལས་ཐར་གྱུར་ཅིག །
en: “ ‘May those whose lives are endangered by attacks from kings and robbers And are in distress from hundreds of various kinds of suffering— All those beings in misfortune and who are suffering— Become freed from hundreds of the greatest, most dreadful terrors.

source: གང་དག་བརྡེགས་ཤིང་བཅིང་བས་བཅིངས་གཟིར་བ། །ཕོངས་པ་སྣ་ཚོགས་དག་ན་གནས་གྱུར་ཅིང་། །ཉོན་མོངས་སྟོང་ཕྲག་དུ་མས་དཀྲུགས་ནས་ཀྱང་། །འཇིགས་པ་མི་བཟད་མྱ་ངན་སྣ་ཚོགས་རྙེད། །
en: “ ‘Those who are beaten, who are in painful bondage, Who remain in various kinds of distress, Who are disturbed by thousands of tribulations And meet various kinds of dreadful terrors and miseries, “ ‘May they all become free from their bonds.

source: དེ་དག་ཐམས་ཅད་བཅིངས་ལས་གྲོལ་གྱུར་ཅིང་། །བརྡེག་པ་དག་ནི་བརྡེག་ལས་ཐར་བར་ཤོག །
en: May those who are beaten be freed from beatings.

source: བསད་པ་རྣམས་ཀྱང་སྲོག་དང་ལྡན་གྱུར་ཅིག །ཕོངས་གྱུར་ཐམས་ཅད་འཇིགས་པ་མེད་པར་ཤོག །
en: May those who are to be killed gain their lives, And may they be free from all distress and fear.

source: སེམས་ཅན་གང་དག་བཀྲེས་སྲེད་སྐོམ་གྱིས་གཟིར། །དེ་དག་ཟས་སྐོམ་སྣ་ཚོགས་རྙེད་པར་ཤོག །
en: “ ‘May the beings who are pained by hunger and thirst Obtain various kinds of food and drink.

source: ལོང་བས་གཟུགས་རྣམས་སྣ་ཚོགས་མཐོང་གྱུར་ཅིག །
en: May the blind see the variety of forms.

source: འོན་པས་ཡིད་འོང་སྒྲ་རྣམས་ཐོས་པར་ཤོག །
en: May the deaf hear pleasant sounds.

source: གཅེར་བུ་རྣམས་ཀྱིས་སྣ་ཚོགས་གོས་རྙེད་གྱུར། །
en: “ ‘May the naked find a variety of clothes.

source: སེམས་ཅན་དབུལ་པོས་གཏེར་རྣམས་རྙེད་པར་ཤོག །
en: May poor beings discover treasures.

source: ནོར་འབྲུ་རིན་ཆེན་སྣ་ཚོགས་མང་པོ་ཡིས། །སེམས་ཅན་ཐམས་ཅད་བདེ་དང་ལྡན་པར་ཤོག །
en: May all beings become happily possessed Of many kinds of wealth, grain, and jewels.

source: གང་ཡང་སྡུག་བསྔལ་ཚོར་བས་གནོད་མ་གྱུར། །
en: “ ‘May no one be afflicted with the experience of suffering.

source: སེམས་ཅན་ཐམས་ཅད་བལྟ་ན་སྡུག་པ་དང་། །གཟུགས་བཟང་མཛེས་ཤིང་ཚུལ་དུ་ཤིས་པར་ཤོག །རྟག་ཏུ་བདེ་བ་དུ་མ་རྫོགས་གྱུར་ཅིག །
en: May all beings become beautiful, With excellent, attractive, pleasant bodies, And always fully possess many kinds of happiness.

source: ཡིད་ཀྱིས་ཟས་སྐོམ་རབ་འབྱོར་བསོད་ནམས་དག །བསམས་མ་ཐག་ཏུ་དེ་དག་གྲུབ་གྱུར་ཅིག །རྫ་རྔ་ཅང་ཏེའུ་པི་བང་སྒྲ་སྙན་དང་། །
en: “ ‘May beings, completely endowed with merit, have food and drink As soon as they think of them.

source: ཆུ་མིག་མཚེའུ་དང་རྫིང་བུ་ལྟེང་ཀ་དང་། །གསེར་གྱི་པདྨ་ཨུཏྤལ་པདྨ་ཅན། །ཟས་སྐོམ་གོས་ནོར་མུ་ཏིག་ནོར་བུ་དབྱིག །རྒྱན་གསེར་རིན་ཆེན་སྣ་ཚོགས་བཻ་ཌཱུརྱ། །དེ་དག་བསམས་མ་ཐག་ཏུ་གྲུབ་གྱུར་ཅིག །
en: May they have melodious vīnas, mṛdaṅga drums, and paṭaha drums; Springs, lakes, ponds, and reservoirs, “ ‘With golden lotuses, and blue and red lotuses; Food and drink, clothes, wealth, pearls, jewels, and other treasures; And jewelry of gold and various other jewels and beryls— May they have them all as soon as they are thought of.

source: འཇིག་རྟེན་གང་ནའང་སྡུག་བསྔལ་སྒྲ་མ་བྱུང་། །
en: “ ‘May the word suffering not exist in any world.

source: སེམས་ཅན་གཅིག་ཀྱང་མི་འཕྲོད་མཐོང་མ་གྱུར། །
en: May not a single inimical being be seen.

source: དེ་དག་ཐམས་ཅད་ཁ་དོག་རྒྱ་ཆེན་དང་། །ཕན་ཚུན་དུ་ནི་འོད་བྱེད་གྱུར་པར་ཤོག །
en: May they all have an illustrious color And may they illuminate each other.

source: མི་ཡི་འཇིག་རྟེན་ཕུན་སུམ་ཚོགས་གང་ཡོད། །དེ་དག་གང་དུ་བསམས་པར་སྐྱེ་བར་གྱུར། །བསམ་པ་ཐམས་ཅད་བསམས་མ་ཐག་ཏུ་ཡང་། །བསོད་ནམས་འབྲས་བུ་ཡོངས་སུ་རྫོགས་པར་ཤོག །
en: “ ‘May that which is perfect in the human world, And arises in the minds of beings, Be complete as the result of their merit As soon as they have wished for it.

source: སྤོས་དང་ཕྲེང་བ་དག་དང་བྱུག་པ་དང་། །གོས་དང་ཕྱེ་མ་མེ་ཏོག་སྣ་ཚོགས་དག །ལྗོན་ཤིང་དག་ལས་དུས་གསུམ་འབབ་པར་ཤོག །སེམས་ཅན་དེ་དག་ལེན་ཅིང་དགར་གྱུར་ཅིག །
en: “ ‘May various perfumes, garlands, ointments, Clothes, powders, and flowers Rain down from trees throughout the three times, And may beings obtain them and be made happy.

source: དེ་བཞིན་གཤེགས་པ་བསམ་ཡས་ཐམས་ཅད་དང་། །རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་། །རྡུལ་བྲལ་དྲི་མེད་བརྟན་པའི་ཆོས་ལ་ཡང་། །ཕྱོགས་བཅུ་རྣམས་སུ་མཆོད་པ་བྱེད་པར་ཤོག །འགྲོ་བ་དམན་པ་ཐམས་ཅད་སྤོང་གྱུར་ཅིག །
en: “ ‘May they make offerings in the ten directions To all the countless tathāgatas, Perfect bodhisattvas, śrāvakas, And the eternal, spotless, stainless Dharma.

source: མི་ཁོམ་བརྒྱད་པོ་དག་ལས་འདས་པར་ཤོག །དལ་བའི་རྒྱལ་པོ་དམ་པ་ཐོབ་གྱུར་ཅིག །རྟག་ཏུ་སངས་རྒྱས་འགྲོགས་པ་ཐོབ་པར་ཤོག །
en: “ ‘May they always avoid lower existences, May they transcend the eight unfortunates states, May they attain the king of fortunate states, And may they always reach the presence of the buddhas.

source: རྟག་ཏུ་མཐོན་པོའི་རིགས་སུ་སྐྱེ་བར་ཤོག །
en: “ ‘May they always be born into a high family.

source: ནོར་དང་འབྲུ་ཡི་མཛོད་རྣམས་འབྱོར་གྱུར་ཅིག །
en: May they possess a treasure of wealth and grain.

source: སྙན་དང་གྲགས་དང་གཟུགས་དང་ཁ་དོག་གིས། །བསྐལ་པ་དུ་མར་ལེགས་པར་བརྒྱན་པར་ཤོག །
en: May they be perfectly adorned throughout many eons By fame, renown, and excellent bodies and color.

source: བུད་མེད་ཐམས་ཅད་རྟག་ཏུ་ཕོར་གྱུར་ཏེ། །དཔའ་ཞིང་རྟུལ་ཕོད་མཁས་ཤིང་གསལ་བར་ཤོག །དེ་ཀུན་རྟག་ཏུ་བྱང་ཆུབ་ཕྱིར་སྤྱོད་གྱུར། །
en: “ ‘May all women always be males Who are heroic, courageous, and wise.

source: ཕ་རོལ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པར་ཤོག །
en: May they all practice for the sake of enlightenment, And may they practice the six perfections.

source: ཕྱོགས་བཅུ་དག་ན་རིན་ཆེན་ཤིང་དབང་དྲུང་། །སངས་རྒྱས་བདེ་བཞུགས་རིན་ཆེན་བཻ་ཌཱུརྱའི། །ཁྲི་ལ་བཞུགས་པ་དག་ནི་མཐོང་གྱུར་ཅིག །ཆོས་བསྟན་པ་ཡང་དེ་དག་ཐོས་གྱུར་ཤོག །
en: “ ‘May they see the buddhas in the ten directions Seated blissfully on thrones of beryl jewels Beneath supreme, precious trees, And may they hear their teaching of the Dharma.

source: བདག་གིས་སྡིག་པའི་ལས་རྣམས་བསྒྲུབས་པ་ནི། །སྲིད་པ་ཉམ་ངར་སྔོན་ཆད་གང་བསྒྲུབས་པ། །སྡིག་ལས་གང་དག་མི་འདོད་འབྲས་ཐོབ་པ། །དེ་དག་ཐམས་ཅད་མ་ལུས་ཟད་གྱུར་ཅིག །
en: “ ‘The bad karma that I have created In perilous lifetimes I previously obtained, And the undesirable results accrued by bad karma, May all of that vanish without any remainder.

source: སེམས་ཅན་གང་དག་སྲིད་པར་བཅིངས་ནས་སུ། །འཁོར་བའི་ཞགས་པའི་ཐག་པས་དམ་བཅིངས་པ། །ཤེས་རབ་ལག་གིས་བཅིངས་པ་བཀྲོལ་བར་ཤོག །སྡུག་བསྔལ་རྣམས་ལས་མྱུར་དུ་ཐར་གྱུར་ཅིག །
en: “ ‘Those beings who are in the bondage of existence, Tightly bound by the noose of saṃsāra, May the hands of wisdom untie their bonds, And may they quickly be freed from suffering.

source: སེམས་ཅན་གང་དག་འཛམ་བུའི་གླིང་འདི་དང་། །གང་དག་འཇིག་རྟེན་ཁམས་ནི་གཞན་རྣམས་ན། །བསོད་ནམས་སྣ་ཚོགས་ཟབ་མོ་རྣམས་བྱེད་པ། །དེ་དག་ཀུན་ལ་རྗེས་སུ་ཡི་རང་ངོ་། །
en: “ ‘I rejoice in the entirety Of the various profound merits Accomplished by beings in this Jambudvīpa And by those who are in other world realms.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱིས་བསྒྲུབས་པ་ཡི། །བདག་གིས་རྗེས་སུ་ཡི་རང་བསོད་ནམས་དེ། །བདག་ནི་སྨོན་གྲུབ་འབྲས་བུ་ཡོད་པར་ཤོག །བྱང་ཆུབ་རྡུལ་བྲལ་བླ་མེད་ཐོབ་གྱུར་ཅིག །
en: “ ‘Through the merit that is created By my rejoicing in body, speech, and mind, May I reach the spotless, highest enlightenment, The result and fulfillment of my prayers.

source: གང་དག་རྟག་དང་དྲི་མ་བྲལ་བ་དང་། །དྲི་མེད་ཡིད་ཀྱིས་ཕྱག་འཚལ་བསྟོད་པ་དང་། །ཡོངས་སུ་བསྔོ་བ་བརྗོད་པ་འདི་ཡིས་ནི། །བསྐལ་པ་དྲུག་ཅུར་ངན་སོང་སྤོང་བར་གྱུར། །
en: “ ‘Someone who pays homage and praises With a mind that is always clear, pure, and unstained Will through this recitation of a dedication Avoid the lower realms for sixty eons.

source: ཚིགས་སུ་བཅད་པ་བརྗོད་པ་འདི་དག་གིས། །སྐྱེས་པ་བུད་མེད་བྲམ་ཟེ་རྒྱལ་རིགས་ལས། །ཐལ་སྦྱར་འདུག་སྟེ་རྒྱལ་བ་གང་བསྟོད་པ། །ཚེ་རབས་ཀུན་ཏུ་སྐྱེ་བ་དྲན་པར་འགྱུར། །
en: “ ‘The men, women, brahmins, and kṣatriyas Who praise the jinas, with palms together in homage, Through the recitation of these verses Will remember their lifetimes in all their lives.

source: ཡན་ལག་དབང་པོ་ཀུན་གྱིས་ཡན་ལག་བརྒྱན། །
en: “ ‘Their limbs will be adorned by all aspects and attributes.

source: བསོད་ནམས་ཡོན་ཏན་སྣ་ཚོགས་རྣམས་དང་ལྡན། །
en: They will be endowed with various merits and qualities.

source: མི་དབང་རྒྱལ་པོས་རྟག་ཏུ་དེ་མཆོད་དེ། །
en: They will be continually offered to by kings, the lords of men.

source: དེ་དང་དེ་དག་ཏུ་ནི་དེ་འདྲར་འགྱུར། །
en: That is what they will be like wherever they are.

source: གང་དག་རྣ་བའི་བུ་གར་བཤགས་པ་འདི་ནི་གྲགས་འགྱུར་བ། །དེ་དག་སངས་རྒྱས་གཅིག་གི་གན་ནས་དགེ་བ་བྱས་མ་ཡིན། །གཉིས་ལ་མ་ཡིན་བཞི་ལ་མ་ཡིན་ལྔ་མིན་བཅུ་ལ་མིན། །དེ་ལྟར་སངས་རྒྱས་སྟོང་གི་གན་ནས་དགེ་བ་བྱས་མ་ཡིན། །
en: “ ‘Those into whose ears the sound of this confession has entered Have not accomplished goodness in the presence of only one buddha, Nor in the presence of only two, or four, or five, or ten, But rather have accomplished goodness in the presence of a thousand buddhas.’ ”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་བཤགས་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཞི་པའོ།། །།འཕགས་པ་གསེར་འོད་དམ་པའི་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བམ་པོ་གཉིས་པ།
en: This concludes “The Confession,” the fourth chapter of “The Lord King of Sūtras, The Sublime Golden Light.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་གསེར་གྱི་ལག་པའི་དབང་པོ་ཞེས་བྱ་བ་དེས།
en: Chapter 5: The Source of Lotus Flowers: A Praise of All the Buddhas Then the Bhagavat said to the noble goddess Bodhisattvasamuccayā, “Noble goddess, at that time, in that time, there was a king by the name of Suvarṇa­bhujendra.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྟོད་པ་པདྨའི་འབྱུང་གནས་འདིས། འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མངོན་པར་བསྟོད་དོ། །
en: Through this praise of all the tathāgatas, The Source of Lotus Flowers, he praised the buddha bhagavats of the past, future, and present.

source: རྒྱལ་བ་གང་དག་སྔར་གྱུར་གང་བྱུང་དང་། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ན་གང་བཞུགས་པ། །རྒྱལ་བ་དེ་དག་རྣམས་ལ་ཕྱག་བགྱིའོ། །རྒྱལ་བ་དེ་དག་ཀུན་ལ་བདག་གིས་བསྟོད། །
en: “ ‘The jinas who have appeared in the past And the jinas present in worlds in the ten directions, I pay homage to those jinas And I praise all those jinas.

source: ཐུབ་དབང་ཞི་ཞིང་རབ་ཞི་རྣམ་པར་དག །
en: “ ‘A lord of munis is peaceful, totally peaceful, and pure.

source: སྐུ་ནི་གསེར་གྱི་མདོག་ཏུ་རབ་ཏུ་གདའ། །
en: His body is a perfect golden color.

source: དབྱངས་རྣམས་ཀུན་གྱིས་སངས་རྒྱས་གསུང་སྙན་ཏེ། །ཚངས་པའི་སྒྲ་དབྱངས་རབ་ཏུ་བསྒྲགས་པའི་གསུང་། །
en: A buddha’s speech is pleasant with every utterance, A speech that resounds like the voice of Brahmā.

source: བུང་བ་རྨ་བྱ་ཨུཏྤལ་སྔོན་པོའི་དབུ། །མཐོན་མཐིང་ལྕང་ལོ་བྱ་ནི་ཙ་ཤ་འདྲ། །
en: “ ‘He has hair like a bee, a peacock, and a blue lotus, With dark blue curls like the blue jaybird.

source: ཁ་བ་དུང་ལྟར་རབ་ཏུ་དཀར་བའི་ཚེམས། །རྟག་ཏུ་གསེར་ལྟར་རྣམ་པར་མཛེས་པར་གདའ། །
en: His teeth are pure white like snow or a conch, And he is always beautiful like gold.

source: སྤྱན་ནི་རིང་ཞིང་མཐོན་མཐིང་དྲི་མ་མེད། །ཨུཏྤལ་སྔོན་པོ་རབ་ཏུ་རྒྱས་པ་འདྲ། །
en: “ ‘His eyes are long, dark blue, and stainless; They are like blossomed blue lotuses.

source: ལྗགས་ནི་ཆེ་ཞིང་ལེགས་ལ་པདྨའི་མདོག །པདྨ་འདྲར་སྣང་པདྨའི་ཟེ་བ་འདྲ། །
en: His broad, excellent tongue is the color of a red lotus, Glowing like a red lotus, like red-lotus anthers.

source: ཞལ་གྱི་མཛོད་སྤུ་པདྨ་དུང་དང་འདྲ། །བཻ་ཌཱུརྱ་ཡི་མདོག་འདྲ་གཡས་སུ་འཁྱིལ། །
en: “ ‘The ūrṇā hair on his face is the color of a conch or lotus root; It curls to the right and is the color of white beryl.

source: ཐུབ་པའི་ཟླ་བ་ཕྲ་ཞིང་ཟླ་བ་ཟད་པ་འདྲ། །
en: It is like a sliver of moon, the last of the moon.

source: སྐུ་ཡི་ལྟེ་བ་བུང་བ་གསལ་བ་བཞིན། །
en: The Muni’s body has a navel as vivid as a carpenter bee.

source: ཞལ་མཐོའི་ཤངས་ནི་རྟག་ཏུ་ལྷག་གེ་སྟེ། །འཇམ་ཞིང་ས་ལའི་གསེར་ལྟར་ཁ་དོག་བཟང་། །
en: “ ‘He has a prominent nose that is always gleaming And is soft and an excellent color, like bright gold.

source: རྟག་པར་རྒྱུན་དུ་རྒྱལ་བ་ཐམས་ཅད་ཀྱི། །རོ་མཆོག་འཇམ་ཞིང་དམ་པ་མཆོག་རབ་འཕགས། །
en: He always, continuously, has the perfect nose of all the jinas, Which is soft, sublime, supreme, and noble.

source: སྤུ་ཡི་བུ་ག་ནས་ནི་རེ་རེ་སྐྱེས། །སྤུ་རྣམས་སྐྱེས་པ་གཡས་སུ་འཁྱིལ་པ་སྟེ། །མཐོན་མཐིང་འོད་འབར་འཚེར་ཞིང་ལྕང་ལོ་ཅན། །རྨ་བྱའི་མགྲིན་སྡུག་འདྲ་བར་སྔོ་ལ་མཛེས། །
en: “ ‘From each and every pore there Rises a hair that curls to the right, A dark blue, shining, gleaming curl, Blue and beautiful like a peacock’s neck.

source: བལྟམས་མ་ཐག་ཏུ་སྐུ་ཡིས་སྣང་བར་བགྱིས། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ནི་ཐམས་ཅད་གང་། །འཇིག་རྟེན་གསུམ་ན་སྡུག་བསྔལ་མཐའ་ཡས་ཞི། །བདེ་བ་ཀུན་གྱི་སེམས་ཅན་རྣམས་ཀྱང་ཚིམ། །
en: “ ‘As soon as he was born, his body shone, Filling all worlds in the ten directions with light, Ending the endless sufferings in the three worlds, And satisfying beings with every happiness.

source: སེམས་དམྱལ་འགྲོ་དང་དུད་འགྲོའི་འགྲོ་བ་དང་། །ཡི་དགས་ལྷ་གནས་མི་ཡི་འགྲོ་རྣམས་སུ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་བདེ་བས་ཚིམ། །ངན་སོང་འགྲོ་བ་རྣམས་ནི་ཐམས་ཅད་ཞི། །
en: “ ‘He satisfied with happiness The beings in the hells, animals, Pretas, devas, and human beings, And brought to an end all lower existences.

source: ཁ་དོག་མདོག་བཟང་གསེར་དང་འདྲ་བའི་འོད། །བཙོ་མའི་གསེར་ལྟར་རབ་ཏུ་སྣང་བའི་སྐུ། །
en: “ ‘His light was the excellent color of gold; His body shone like purified gold.

source: བདེ་གཤེགས་ཟླ་བ་རབ་ཏུ་དྲི་མེད་ཞལ། །འཛུམ་ཞིང་རྣམ་མཛེས་ཤིན་ཏུ་དྲི་མེད་ཞལ། །
en: His perfectly stainless face is a sugata moon, His stainless mouth smiling beautifully.

source: གཞོན་ནུ་བཙས་འདྲར་སྐུ་ལུས་ཡན་ལག་འཇམ། །
en: “ ‘His body and limbs are soft like a young boy’s.

source: སེང་གེ་འདྲ་བར་རྩལ་གྱིས་གནོན་པའི་མཆོག །
en: He has a perfect, powerful stride like a lion’s.

source: ཕྱག་རིང་ཕྱག་ནི་རབ་ཏུ་རིང་བ་སྟེ། །སཱ་ལའི་ལྕུག་མ་རླུང་གིས་བསྐྱོད་པ་བཞིན། །
en: He has long hands and very long arms Like vines on a sal tree moved by the breeze.

source: འདོམ་གང་འོད་འབར་འོད་ཟེར་རབ་ཏུ་གཏོང་། །ཉི་མ་སྟོང་ལྟར་རབ་ཏུ་ལྷག་གེའོ། །
en: “ ‘He has a fathom-wide aura that radiates light; He is as bright as a thousand suns.
